In [3]:
import pandas as pd

file = "Resources/purchase_data.csv"

p_df = pd.read_csv(file)
p_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [4]:
p_df.rename(mapper = lambda i: i.replace(' ','').lower(), axis = 1, inplace = True)
p_df

,purchaseid,sn,age,gender,itemid,itemname,price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [8]:
###Put results in dataframes
###Use unique to get total number of players
pd.DataFrame([p_df["sn"].nunique()], columns = ["Total Players"])

   Total Players
0            576

In [11]:
#items.nunique
pd.DataFrame([[p_df["itemname"].nunique(), p_df["price"].mean(), p_df["purchaseid"].count(), p_df["price"].sum()]], \
      columns = ["Number of Unique", "Items Average Price", "Number of Purchases", "Total Revenue"])

   Number of Unique  Items Average Price  Number of Purchases  Total Revenue
0               179             3.050987                  780        2379.77

In [6]:
#reduce df by sn
p2_df = p_df.drop_duplicates(subset=["sn"])
gender_df = p2_df["gender"].value_counts().to_frame()
gender_df["Percentage of Players"] = gender_df["gender"]/gender_df["gender"].sum()
gender_df

                       gender  Percentage of Players
Male                      484               0.840278
Female                     81               0.140625
Other / Non-Disclosed      11               0.019097

In [18]:
df = pd.DataFrame({'id': ['spam', 'egg', 'egg', 'spam',
                          'ham', 'ham'],
                   'value1': [1, 5, 5, 2, 5, 5],
                   'value2': list('abbaxy')})
df
df.groupby('id').nunique()

      id  value1  value2
id
egg    1       1       1
ham    1       1       2
spam   1       2       1

In [15]:
p1 = p_df[["gender","sn"]].groupby("gender").count()
p2 = p_df[["gender","price"]].groupby("gender").sum()
p3 = p_df[["gender","sn"]].groupby("gender").nunique().drop(columns = 'gender').rename(columns = {"sn":"unique"})
genderanalysis = pd.merge(pd.merge(p1, p2, on = "gender"),p3, on="gender")
genderanalysis["Average Purchase Price"] = genderanalysis["price"]/genderanalysis["sn"]
genderanalysis["Avg Total Purchase per Person"] = genderanalysis["price"]/genderanalysis["unique"]
genderanalysis.rename(columns = {"price":"Total Purchase Value", "sn" : "Purchase Count"}, inplace=True)
genderanalysis.index.rename(name = "Gender")
genderanalysis.drop(columns = ["unique"], inplace=True)
genderanalysis

,Purchase Count,Total Purchase Value,Average Purchase Price,Avg Total Purchase per Person
gender,,,,
Female,113,361.94,3.203009,4.468395
Male,652,1967.64,3.017853,4.065372
Other / Non-Disclosed,15,50.19,3.346000,4.562727

In [14]:
p1 = p_df[["gender","sn"]].groupby("gender").nunique()
p1

                       gender   sn
gender
Female                      1   81
Male                        1  484
Other / Non-Disclosed       1   11

In [303]:
bins = [5*i - 1 for i in range(2,9)]
groupnames = [str(i + 1)+'-'+str(i + 5) for i in bins[:-1]]
bins.insert(0,0)
bins.append(100)
groupnames.insert(0, "<10")
groupnames.append(">40")
pages_df = p_df.copy()
pages_df["age range"] = pd.cut(pages_df["age"], bins, labels = groupnames, include_lowest = False)

In [304]:
agecount_df = pages_df[["age range","sn"]].drop_duplicates(subset=["sn"]).groupby("age range").count().rename(columns = {"sn":"Total Count"})
agecount_df
agecount_df["Percentage of players"] = agecount_df["Total Count"]/agecount_df["Total Count"].sum()
agecount_df.index.rename(None, inplace = True)
agecount_df

       Total Count  Percentage of players
<10             17               0.029514
10-14           22               0.038194
15-19          107               0.185764
20-24          258               0.447917
25-29           77               0.133681
30-34           52               0.090278
35-39           31               0.053819
>40             12               0.020833

In [309]:
p1 = pages_df[["age range","sn"]].groupby("age range").count()
p2 = pages_df[["age range","price"]].groupby("age range").sum()
p3 = pages_df[["age range","sn"]].groupby("age range").nunique().drop(columns = "age range").rename(columns = {"sn":"unique"})
ageanalysis = pd.merge(pd.merge(p1, p2, on = "age range"),p3, on="age range")
ageanalysis["Average Purchase Price"] = ageanalysis["price"]/ageanalysis["sn"]
ageanalysis["Avg Total Purchase per Person"] = ageanalysis["price"]/ageanalysis["unique"]
ageanalysis.rename(columns = {"price":"Total Purchase Value", "sn" : "Purchase Count"}, inplace=True)
ageanalysis.index.rename(name = "Age Range", inplace = True)
ageanalysis.drop(columns = ["unique"], inplace=True)
ageanalysis

,Purchase Count,Total Purchase Value,Average Purchase Price,Avg Total Purchase per Person
Age Range,,,,
<10,23,77.13,3.353478,4.537059
10-14,28,82.78,2.956429,3.762727
15-19,136,412.89,3.035956,3.858785
20-24,365,1114.06,3.052219,4.318062
25-29,101,293.00,2.900990,3.805195
30-34,73,214.00,2.931507,4.115385
35-39,41,147.67,3.601707,4.763548
>40,13,38.24,2.941538,3.186667

In [336]:
temp = p_df[["sn","price"]].groupby("sn").sum().sort_values("price", ascending = False).head(5)
temp2 = p_df[["sn","price"]].groupby("sn").count()
topspenders = pd.merge(temp,temp2, on = "sn")
topspenders["Average Purchase Value"] = topspenders["price_x"]/topspenders["price_y"]
topspenders = topspenders[["price_y","Average Purchase Value","price_x"]]
topspenders.rename(columns = {"price_x" : "Average Purchase Price", "price_y" : "Purchase Count"}, inplace=True)
topspenders.index.rename("SN", inplace=True)
topspenders

             Purchase Count  Average Purchase Value  Average Purchase Price
SN
Lisosia93                 5                3.792000                   18.96
Idastidru52               4                3.862500                   15.45
Chamjask73                3                4.610000                   13.83
Iral74                    4                3.405000                   13.62
Iskadarya95               3                4.366667                   13.10